## Production: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 36 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                                NAME                                                                                |
|--------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_gc_design_system_export.aws_kms_alias.gc_design_system_exports`                                                                                   |
|        | `module.platform_gc_design_system_export.aws_kms_key.gc_design_system_exports`                                                                                     |
|        | `module.platform_gc_design_system_export.aws_lambda_event_source_mapping.cloudfront_sqs_trigger`                                                                   |
|        | `module.platform_gc_design_system_export.aws_s3_bucket_notification.cloudfront_trigger`                                                                            |
|        | `module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_dlq`                                                                                  |
|        | `module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_queue`                                                                                |
|        | `module.platform_gc_design_system_export.aws_sqs_queue_policy.cloudfront_s3_events`                                                                                |
|        | `module.platform_gc_design_system_export.aws_sqs_queue_redrive_policy.cloudfront_processing_queue_redrive`                                                         |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_cloudwatch_event_rule.this`                                        |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_cloudwatch_event_target.this`                                      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_ecr_lifecycle_policy.this[0]`                                      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_ecr_repository.this[0]`                                            |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_lambda_permission.this`                                            |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_cloudwatch_event_rule.this`                                               |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_cloudwatch_event_target.this`                                             |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_ecr_lifecycle_policy.this[0]`                                             |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_ecr_repository.this[0]`                                                   |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_lambda_permission.this`                                                   |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_cloudwatch_log_group.this`                      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_policy.policies[0]`                         |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_role.this`                                  |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_lambda_function.this`                           |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_cloudwatch_log_group.this`                             |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`         |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                        |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_iam_policy.policies[0]`                                |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_iam_role.this`                                         |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`             |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`         |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]`        |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.module.this_lambda.aws_lambda_function.this`                                  |
| update | `module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key`                                                                                       |
|        | `module.platform_gc_design_system_export.module.platform_gc_design_system_export.module.this_lambda.aws_iam_policy.policies[0]`                                    |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/data-lake/actions/runs/17216149547).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_gc_design_system_export.data.aws_iam_policy_document.platform_gc_design_system_cloudfront_export will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "platform_gc_design_system_cloudfront_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-raw-production/platform/gc-design-system/cloudfront-logs/*",
            ]
          + sid       = "ReadFromS3RawBucket"
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-transformed-production/platform/gc-design-system/cloudfront-logs/*",
            ]
          + sid       = "WriteToS3TransformedBucket"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ReceiveFromSQS"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "UseKMSForSQS"
        }
    }

  # module.platform_gc_design_system_export.data.aws_iam_policy_document.platform_gc_design_system_export will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "platform_gc_design_system_export" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:739275439843:parameter/platform/gc-design-system/airtable-api-key",
            ]
          + sid       = "GetSSMParameters"
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-raw-production/platform/gc-design-system/airtable/*",
              + "arn:aws:s3:::cds-data-lake-transformed-production/platform/gc-design-system/airtable/*",
            ]
          + sid       = "WriteToS3Bucket"
        }
      + statement {
          + actions   = [
              + "glue:GetCrawler",
              + "glue:StartCrawler",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:glue:ca-central-1:739275439843:crawler/Platform / GC Design System / Airtable",
            ]
          + sid       = "StartGlueCrawler"
        }
    }

  # module.platform_gc_design_system_export.aws_kms_alias.gc_design_system_exports will be created
  + resource "aws_kms_alias" "gc_design_system_exports" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/gc-design-system-exports"
      + name_prefix    = (known after apply)
      + region         = "ca-central-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.platform_gc_design_system_export.aws_kms_key.gc_design_system_exports will be created
  + resource "aws_kms_key" "gc_design_system_exports" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for GC Design System data export encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::739275439843:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:RetireGrant",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sqs.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow SQS service"
                    },
                  + {
                      + Action    = [
                          + "kms:RetireGrant",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Lambda service"
                    },
                  + {
                      + Action    = [
                          + "kms:RetireGrant",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow S3 service"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ca-central-1.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudWatch Logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ca-central-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCentre" = "PlatformDataLake"
        }
      + tags_all                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.aws_lambda_event_source_mapping.cloudfront_sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "cloudfront_sqs_trigger" {
      + arn                                = (known after apply)
      + batch_size                         = 50
      + enabled                            = true
      + event_source_arn                   = (known after apply)
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 300
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + region                             = "ca-central-1"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + uuid                               = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.platform_gc_design_system_export.aws_s3_bucket_notification.cloudfront_trigger will be created
  + resource "aws_s3_bucket_notification" "cloudfront_trigger" {
      + bucket      = "cds-data-lake-raw-production"
      + eventbridge = false
      + id          = (known after apply)
      + region      = "ca-central-1"

      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "platform/gc-design-system/cloudfront-logs/"
          + filter_suffix = ".gz"
          + id            = (known after apply)
          + queue_arn     = (known after apply)
        }
    }

  # module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_dlq will be created
  + resource "aws_sqs_queue" "cloudfront_processing_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "platform-gc-design-system-cloudfront-processing-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ca-central-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Billing" = "PlatformDataLake"
        }
      + tags_all                          = {
          + "Billing"    = "PlatformDataLake"
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_queue will be created
  + resource "aws_sqs_queue" "cloudfront_processing_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "platform-gc-design-system-cloudfront-processing"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ca-central-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Billing" = "PlatformDataLake"
        }
      + tags_all                          = {
          + "Billing"    = "PlatformDataLake"
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 960
    }

  # module.platform_gc_design_system_export.aws_sqs_queue_policy.cloudfront_s3_events will be created
  + resource "aws_sqs_queue_policy" "cloudfront_s3_events" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
      + region    = "ca-central-1"
    }

  # module.platform_gc_design_system_export.aws_sqs_queue_redrive_policy.cloudfront_processing_queue_redrive will be created
  + resource "aws_sqs_queue_redrive_policy" "cloudfront_processing_queue_redrive" {
      + id             = (known after apply)
      + queue_url      = (known after apply)
      + redrive_policy = (known after apply)
      + region         = "ca-central-1"
    }

  # module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key will be updated in-place
  ~ resource "aws_ssm_parameter" "airtable_api_key" {
        id              = "/platform/gc-design-system/airtable-api-key"
        name            = "/platform/gc-design-system/airtable-api-key"
        tags            = {}
      ~ version         = 1 -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-gc-design-system-cloudfront-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-gc-design-system-cloudfront-export-schedule"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "rate(365 days)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + rule           = "platform-gc-design-system-cloudfront-export-schedule"
      + target_id      = "platform-gc-design-system-cloudfront-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep most recent 10 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ca-central-1"
      + registry_id = (known after apply)
      + repository  = "platform-gc-design-system-cloudfront-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "platform-gc-design-system-cloudfront-export"
      + region               = "ca-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-gc-design-system-cloudfront-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-gc-design-system-cloudfront-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-gc-design-system-npm-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-gc-design-system-npm-export-schedule"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "cron(0 5 * * ? *)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + rule           = "platform-gc-design-system-npm-export-schedule"
      + target_id      = "platform-gc-design-system-npm-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep most recent 10 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ca-central-1"
      + registry_id = (known after apply)
      + repository  = "platform-gc-design-system-npm-export"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "platform-gc-design-system-npm-export"
      + region               = "ca-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_npm_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-gc-design-system-npm-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-gc-design-system-npm-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/platform-gc-design-system-cloudfront-export"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/platform-gc-design-system-cloudfront-export",
        ]
      + name                = "Lambda Statistics / platform-gc-design-system-cloudfront-export"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
      + region              = "ca-central-1"
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-gc-design-system-cloudfront-export_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-gc-design-system-cloudfront-export-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-gc-design-system-cloudfront-export"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.platform_gc_design_system_export.module.platform_gc_design_system_cloudfront_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-gc-design-system-cloudfront-export"
    }

  #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_kms_key.gc_design_system_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_lambda_event_source_mapping.cloudfront_sqs_trigger"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_dlq"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main -...
```

</details>
